package service;

/**
 * description
 *
 * @author Alexander Isai on 09.04.2024.
 */
public class ConsoleMessage {

    public String[] newHumanRequest(String type){
        return new String[]{"Введіть ім'я " + type, "Введіть прізвище " + type, "Введіть рік народження " + type,
                "Введіть місяць народження " + type, "Введіть день народження " + type, "Введіть рівень iq " + type};
    }

    public String getMainMenu() {
        return """
                - 1. Заповнити тестовими даними (автоматом створити кілька сімей та зберегти їх у базі)
                - 2. Відобразити весь список сімей (відображає список усіх сімей з індексацією, що починається з 1)
                - 3. Відобразити список сімей, де кількість людей більша за задану
                - 4. Відобразити список сімей, де кількість людей менша за задану
                - 5. Підрахувати кількість сімей, де кількість членів дорівнює
                - 6. Створити нову родину
                - 7. Видалити сім'ю за індексом сім'ї у загальному списку
                - 8. Редагувати сім'ю за індексом сім'ї у загальному списку
                - 9. Видалити всіх дітей старше віку (у всіх сім'ях видаляються діти старше зазначеного віку - вважатимемо, що вони виросли)
                - 10. Зберегти колекцію родин у файл
                - 11. Завантажити колекцію родин з файлу
                """;
    }

    public String getNumberRequest() {
        return "Введіть цікаве число";
    }
    public String getNumberOfFamilyRequest() {
        return "Оберіть родину за номером ID";
    }

    public String getUpdateFamily() {
        return """
                1. Народити дитину
                2. Усиновити дитину
                3. Повернутися до головного меню
                """;
    }

    public String getAgeRequest() {
        return "Введіть вік дитини, з якого вона вважається дорослою";
    }

    public String getChildNameRequest() {
        return "Введіть ім'я для хлопчика та для дівчинки (через пробіл)";
    }

}
